const posts = [
    { 
        id: 1,
        title: "آشنایی با بازار فارکس و نحوه عملکرد آن", 
        content: "بازار فارکس (Forex) بزرگترین بازار مالی جهان است که در آن ارزهای مختلف به صورت جفت ارزها مبادله می‌شوند. این بازار غیرمتمرکز و 24 ساعته فعال است. در فارکس، نرخ تبدیل ارزها تحت تأثیر عوامل مختلفی مانند عرضه و تقاضا، اخبار اقتصادی و تصمیمات سیاسی تغییر می‌کند. در این بازار، جفت ارزهایی مانند EUR/USD معامله می‌شوند که نشان‌دهنده قیمت یک ارز در برابر ارز دیگر است. تحلیل بازار فارکس به دو دسته اصلی تحلیل فاندامنتال و تحلیل تکنیکال تقسیم می‌شود.",
        image: "forex1.jpg"
    },
    { 
        id: 2,
        title: "استراتژی‌های موفق در بازار فارکس", 
        content: "در بازار فارکس، استفاده از استراتژی مناسب می‌تواند تفاوت بزرگی در موفقیت شما ایجاد کند. برخی از استراتژی‌های رایج شامل اسکالپینگ، پیروی از روند، تجزیه و تحلیل فاندامنتال و پرایس اکشن هستند. اسکالپینگ به انجام معاملات سریع و کسب سودهای کوچک در مدت کوتاه اشاره دارد. پیروی از روند به شناسایی روندهای قوی بازار و معامله در جهت آنها مربوط می‌شود. تجزیه و تحلیل فاندامنتال بررسی اخبار اقتصادی و تصمیمات سیاسی است که می‌تواند بر قیمت ارزها تأثیر بگذارد.",
        image: "forex2.jpg"
    },
    { 
        id: 3,
        title: "مدیریت ریسک در بازار فارکس", 
        content: "مدیریت ریسک در فارکس به حفظ سرمایه و کاهش ضررها کمک می‌کند. برخی از اصول مدیریت ریسک عبارتند از: تعیین حجم معاملات به نسبت اندازه حساب، استفاده از دستور توقف ضرر (Stop Loss) برای محدود کردن ضررها، تنوع در معاملات برای کاهش ریسک، و پیش‌بینی نوسانات بازار با استفاده از تحلیل‌های فاندامنتال و تکنیکال. رعایت این اصول می‌تواند به شما کمک کند تا از خطرات بازار فارکس جلوگیری کرده و موفق‌تر باشید.",
        image: "forex3.jpg"
    }

];

function displayPosts() {
    const postsContainer = document.getElementById("posts");
    postsContainer.innerHTML = "";

    posts.forEach(post => {
        const postDiv = document.createElement("div");
        postDiv.classList.add("post");
        postDiv.innerHTML = `
            <h2><a href="article.html?id=${post.id}">${post.title}</a></h2>
            <img src="${post.image}" alt="${post.title}" width="100%">
            <p>${post.content.substring(0, 100)}...</p>
            <a href="article.html?id=${post.id}">ادامه مطلب</a>
        `;
        postsContainer.appendChild(postDiv);
    });
}

displayPosts();
